def solve_tasks():
    """
    Выполните задания внутри этой функции.
    """
    # Задание 1: Создайте переменные name и age, присвоив им ваше имя и возраст.
    ...  # TODO: Впишите ваше имя
    ...    # TODO: Впишите ваш возраст

    print(f"Меня зовут: {...}")
    print(f"Мой возраст: {...}")

    # Задание 2: Рассчитайте, сколько вам будет лет через 10 лет.
    # Создайте переменную future_age и запишите в нее результат.
    ...  # TODO: Рассчитайте и присвойте результат

    print(f"Через 10 лет мне будет: {...}")

    # Задание 3: У вас было 15 яблок. Вы отдали 4 яблока другу.
    # Рассчитайте, сколько яблок у вас осталось.
    # Создайте переменные total_apples, apples_given, apples_left.
    ...
    ...
    ...  # TODO: Рассчитайте и присвойте результат

    print(f"У меня осталось яблок: {...}")


if __name__ == "__main__":
    solve_tasks()
