def solve_tasks():
    """
    Выполните задания внутри этой функции.
    """
    # Задание 1: Создайте переменные name и age, присвоив им ваше имя и возраст.
Name = "Дулат"
age = 27
    
print(f"Меня зовут: {Name}")
print(f"Мой возраст: {age}")

    # Задание 2: Рассчитайте, сколько вам будет лет через 10 лет.
    # Создайте переменную future_age и запишите в нее результат.
...  # TODO: Рассчитайте и присвойте результат

name_ferst = "Дулат"
Age = 27
Resultat = Age + int(10)

print(f"Через 10 лет мне будет: {Resultat}")

    # Задание 3: У вас было 15 яблок. Вы отдали 4 яблока другу.
    # Рассчитайте, сколько яблок у вас осталось.
    # Создайте переменные total_apples, apples_given, apples_left.
total_apples = int(15)
apples_given = int(4)
apples_left = total_apples - apples_given


print(f"У меня осталось яблок: {apples_left}")


if __name__ == "__main__":
    solve_tasks()
